/*
 Navicat Premium Data Transfer

 Source Server         : mysqltest
 Source Server Type    : MySQL
 Source Server Version : 80043 (8.0.43)
 Source Host           : localhost:3306
 Source Schema         : express

 Target Server Type    : MySQL
 Target Server Version : 80043 (8.0.43)
 File Encoding         : 65001

 Date: 03/11/2025 23:35:29
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for locker
-- ----------------------------
DROP TABLE IF EXISTS `locker`;
CREATE TABLE `locker`  (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '快递柜ID（自增）',
  `express_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '快递号（会随着快递的取出和寄入改变）',
  `district` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '快递柜属于的区（仅限上海各区）',
  `size` enum('大','中','小') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '快递柜容量',
  `status` tinyint NULL DEFAULT 0 COMMENT '状态（0-空闲，1-占用）',
  `created_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_district_size`(`district` ASC, `size` ASC) USING BTREE,
  INDEX `idx_status`(`status` ASC) USING BTREE,
  INDEX `idx_express_number`(`express_number` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 241 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '快递柜表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of locker
-- ----------------------------
INSERT INTO `locker` VALUES (1, NULL, '黄浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (2, '1130092', '黄浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (3, '1130059', '黄浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (4, NULL, '黄浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (5, '1130029', '黄浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (6, '1130010', '黄浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (7, '1130012', '黄浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (8, '1130044', '黄浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (9, NULL, '黄浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (10, NULL, '黄浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (11, '1130087', '黄浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (12, '113004', '黄浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (13, '1130083', '黄浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (14, '12600', '黄浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (15, NULL, '黄浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (16, NULL, '徐汇区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (17, '1130061', '徐汇区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (18, '1130043', '徐汇区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (19, NULL, '徐汇区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (20, '1130053', '徐汇区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (21, NULL, '徐汇区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (22, NULL, '徐汇区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (23, NULL, '徐汇区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (24, NULL, '徐汇区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (25, '1130086', '徐汇区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (26, NULL, '徐汇区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (27, '113001', '徐汇区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (28, NULL, '徐汇区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (29, NULL, '徐汇区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (30, NULL, '徐汇区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (31, '888888', '长宁区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (32, NULL, '长宁区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (33, '1130020', '长宁区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (34, NULL, '长宁区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (35, '1130047', '长宁区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (36, NULL, '长宁区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (37, '1130080', '长宁区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (38, NULL, '长宁区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (39, '1130091', '长宁区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (40, '1250011', '长宁区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (41, NULL, '长宁区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (42, '1130032', '长宁区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (43, NULL, '长宁区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (44, NULL, '长宁区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (45, '1130011', '长宁区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (46, NULL, '静安区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (47, NULL, '静安区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (48, '1130076', '静安区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (49, NULL, '静安区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (50, NULL, '静安区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (51, NULL, '静安区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (52, NULL, '静安区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (53, NULL, '静安区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (54, '1130054', '静安区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (55, NULL, '静安区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (56, NULL, '静安区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (57, '1130015', '静安区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (58, '1130079', '静安区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (59, '1130058', '静安区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (60, NULL, '静安区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (61, NULL, '普陀区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (62, NULL, '普陀区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (63, NULL, '普陀区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (64, NULL, '普陀区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (65, NULL, '普陀区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (66, '113003', '普陀区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (67, NULL, '普陀区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (68, '1130099', '普陀区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (69, '1130068', '普陀区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (70, NULL, '普陀区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (71, NULL, '普陀区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (72, NULL, '普陀区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (73, NULL, '普陀区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (74, NULL, '普陀区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (75, '1130056', '普陀区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (76, NULL, '虹口区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (77, '1130095', '虹口区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (78, NULL, '虹口区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (79, '1130062', '虹口区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (80, NULL, '虹口区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (81, NULL, '虹口区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (82, NULL, '虹口区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (83, '1130055', '虹口区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (84, NULL, '虹口区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (85, NULL, '虹口区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (86, '1130081', '虹口区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (87, NULL, '虹口区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (88, '1130070', '虹口区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (89, NULL, '虹口区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (90, '1130025', '虹口区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (91, NULL, '杨浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (92, NULL, '杨浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (93, NULL, '杨浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (94, NULL, '杨浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (95, '1130042', '杨浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (96, NULL, '杨浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (97, NULL, '杨浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (98, NULL, '杨浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (99, NULL, '杨浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (100, '1130017', '杨浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (101, '1130073', '杨浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (102, NULL, '杨浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (103, NULL, '杨浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (104, NULL, '杨浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (105, '1130077', '杨浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (106, NULL, '闵行区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (107, '1130096', '闵行区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (108, NULL, '闵行区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (109, NULL, '闵行区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:48:05');
INSERT INTO `locker` VALUES (110, NULL, '闵行区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (111, NULL, '闵行区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (112, NULL, '闵行区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (113, '113006', '闵行区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (114, '1130067', '闵行区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (115, '113002', '闵行区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (116, NULL, '闵行区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (117, NULL, '闵行区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (118, '1130048', '闵行区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (119, NULL, '闵行区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (120, '1130031', '闵行区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (121, '1130063', '宝山区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (122, NULL, '宝山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (123, NULL, '宝山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (124, NULL, '宝山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (125, NULL, '宝山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (126, '1130021', '宝山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (127, '1130038', '宝山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (128, NULL, '宝山区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (129, '1130013', '宝山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (130, '1130045', '宝山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (131, NULL, '宝山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (132, '1130030', '宝山区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (133, NULL, '宝山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (134, NULL, '宝山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (135, NULL, '宝山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (136, NULL, '嘉定区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (137, '1130071', '嘉定区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (138, '1130084', '嘉定区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (139, '113009', '嘉定区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (140, '1130023', '嘉定区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (141, '1130088', '嘉定区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (142, '000111213', '嘉定区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (143, NULL, '嘉定区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (144, NULL, '嘉定区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (145, '1130037', '嘉定区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (146, '1130019', '嘉定区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (147, NULL, '嘉定区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (148, NULL, '嘉定区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (149, '1130065', '嘉定区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (150, NULL, '嘉定区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (151, NULL, '浦东新区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (152, NULL, '浦东新区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (153, '1130024', '浦东新区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (154, '1130093', '浦东新区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (155, '1130049', '浦东新区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (156, NULL, '浦东新区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (157, '1130097', '浦东新区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (158, NULL, '浦东新区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (159, NULL, '浦东新区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (160, NULL, '浦东新区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (161, '1130041', '浦东新区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (162, NULL, '浦东新区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (163, NULL, '浦东新区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (164, NULL, '浦东新区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (165, NULL, '浦东新区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (166, NULL, '金山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (167, NULL, '金山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (168, '1130085', '金山区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (169, NULL, '金山区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (170, '1130026', '金山区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (171, NULL, '金山区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (172, NULL, '金山区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (173, '1130078', '金山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (174, '1130022', '金山区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (175, NULL, '金山区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (176, NULL, '金山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (177, NULL, '金山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (178, '1130051', '金山区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (179, NULL, '金山区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (180, '1130036', '金山区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (181, '1130082', '松江区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (182, NULL, '松江区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (183, NULL, '松江区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (184, NULL, '松江区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (185, '12000', '松江区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (186, NULL, '松江区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (187, NULL, '松江区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (188, '113007', '松江区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (189, '1130014', '松江区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (190, '1130075', '松江区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (191, NULL, '松江区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (192, '113005', '松江区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (193, NULL, '松江区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (194, '1130064', '松江区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (195, NULL, '松江区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (196, '1130039', '青浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (197, NULL, '青浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (198, '1130060', '青浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (199, '1130033', '青浦区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (200, NULL, '青浦区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (201, '127000', '青浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (202, NULL, '青浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (203, '1130066', '青浦区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (204, NULL, '青浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (205, NULL, '青浦区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (206, '1130028', '青浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (207, NULL, '青浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (208, '1130052', '青浦区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (209, NULL, '青浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (210, NULL, '青浦区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (211, '1130050', '奉贤区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (212, NULL, '奉贤区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:41:30');
INSERT INTO `locker` VALUES (213, NULL, '奉贤区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (214, '1130090', '奉贤区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (215, NULL, '奉贤区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (216, NULL, '奉贤区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 19:04:44');
INSERT INTO `locker` VALUES (217, '1130072', '奉贤区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (218, '1130034', '奉贤区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (219, '1130027', '奉贤区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (220, NULL, '奉贤区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (221, NULL, '奉贤区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (222, '1130098', '奉贤区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (223, '128123', '奉贤区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (224, '1130057', '奉贤区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (225, '1130040', '奉贤区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (226, '1130016', '崇明区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (227, NULL, '崇明区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (228, '1130074', '崇明区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (229, '1130046', '崇明区', '大', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (230, NULL, '崇明区', '大', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (231, NULL, '崇明区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (232, NULL, '崇明区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (233, NULL, '崇明区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (234, NULL, '崇明区', '中', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (235, '1130018', '崇明区', '中', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (236, '1130069', '崇明区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');
INSERT INTO `locker` VALUES (237, NULL, '崇明区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (238, '113008', '崇明区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:22');
INSERT INTO `locker` VALUES (239, NULL, '崇明区', '小', 0, '2025-11-03 18:22:48', '2025-11-03 18:22:48');
INSERT INTO `locker` VALUES (240, '1130035', '崇明区', '小', 1, '2025-11-03 18:22:48', '2025-11-03 18:23:23');

SET FOREIGN_KEY_CHECKS = 1;
